#/bin/bash

# upload war package to server


WORK_DIRECTORY=/tmp
REMOTE_HOST_1=125.64.15.21
REMOTE_HOST_2=192.168.10.39
REMOTE_HOST_3=125.64.15.22
REMOTE_HOST_4=116.62.31.64
REMOTE_HOST_5=125.64.15.28
REMOTE_HOST_6=118.178.234.43
REMOTE_HOST_7=121.40.49.134
REMOTE_HOST_8=114.55.108.26
REMOTE_HOST_9=118.31.112.251

USER=go2xiaoxing

cat <<EOF
=============================================================================================
|项目名称               | 反向代理端口        | tomcat端口(主)         | tomcat端口(备)      |
=============================================================================================|
|新品预发布(publish)    | 192.168.10.35:43010 | 192.168.10.35:43011    | 192.168.10.35:43020 |
|---------------------------------------------------------------------------------------------
|摄影门户(photography)  | sy.go2.cn           | 192.168.10.35:18000    |                     |
|---------------------------------------------------------------------------------------------
|短信接口(sms)          |                     | 192.168.10.35:21010    |                     |
|---------------------------------------------------------------------------------------------
|用户行为(behavior)     |                     | 192.168.10.35:32010    |                     |
|---------------------------------------------------------------------------------------------
|商品缓存(cache)        | 192.168.10.37:16100 | 192.168.10.40:16110    | 192.168.10.40:16120 |
|---------------------------------------------------------------------------------------------
|商品搜索(search)       | 192.168.10.37:16200 | 192.168.10.51:16210    | 192.168.10.39:16210 |
|---------------------------------------------------------------------------------------------
|搜索管理(searchmgt)    | 192.168.10.37:16300 | 192.168.10.51:16310    |                     |
|---------------------------------------------------------------------------------------------
|商品打标(product2tag)  | tag.ximgs.net       | 192.168.10.35:53010    |                     |
|---------------------------------------------------------------------------------------------
|南通代发(嘉禾)         | 192.168.10.40:80    | 192.168.10.40:13010    |                     |
|---------------------------------------------------------------------------------------------
|南通代发(录入)         | 192.168.10.40:80    | 192.168.10.40:12010    |                     | 
|---------------------------------------------------------------------------------------------
|南通代发(移动)         | 192.168.10.40:80    | 192.168.10.40:14010    |                     |
|---------------------------------------------------------------------------------------------
|用户中心(userCenter)   | 192.168.10.37:80    | 192.168.10.35:16520    | 192.168.10.51:16520 |
|---------------------------------------------------------------------------------------------
|数据平台(dataplatform) |                     | :23010                 |                     |
|---------------------------------------------------------------------------------------------
|帐户系统(sysmgt)       | 192.168.10.37:16800 | 192.168.10.51:16810    | 192.168.10.51:16820 |
|---------------------------------------------------------------------------------------------
|jvm监控系统(observer)  | 192.168.10.37:16700 | 192.168.10.51:16710    |                     |
|---------------------------------------------------------------------------------------------
|2mm用户中心(mm2userCenter)废弃          | usercenter.2mm.cn   | 192.168.10.51:26510    | 192.168.10.51:26520 |
|---------------------------------------------------------------------------------------------
|微信(weixinmgt)        | wx.go2.cn           | 192.168.10.51:36100    |                     |
|---------------------------------------------------------------------------------------------
|广告系统(admgt)        | 192.168.10.37:28300 | 192.168.10.51:28310    | 192.168.10.51:28320 |
|---------------------------------------------------------------------------------------------
|2mm打标(mm2product2tag)|                     | :63010                 |                     |
|---------------------------------------------------------------------------------------------
|购商宝www主站前端系统  | 118.178.131.112:80  | 127.0.0.1:16010        | 127.0.0.1:16020     |
|---------------------------------------------------------------------------------------------
|购商宝mgt后台管理系统  | 118.178.131.112:80  | 127.0.0.1:17010        |                     |
|---------------------------------------------------------------------------------------------
|userTask               |                     | 192.168.10.35:65300    |                     |
|---------------------------------------------------------------------------------------------
|购商宝发布淘宝         | 121.199.160.248:80  | 121.199.160.248:12800  |                     |
|---------------------------------------------------------------------------------------------
|monitorweb             | monitorweb.ximgs.net| 192.168.10.51:24210    |                     |
|---------------------------------------------------------------------------------------------
|mmuserCenter           | 192.168.10.37:52100 | 192.168.10.35:52110    |                     |
----------------------------------------------------------------------------------------------
|navigate               | dh.2mm.cn           | 192.168.10.35:45100    | 192.168.10.35:45110 |
----------------------------------------------------------------------------------------------
|sitemapmgt             | sm.ximgs.net        | 192.168.10.35:37010    |                     |
----------------------------------------------------------------------------------------------
|producer               | 192.168.10.37:12300 | 192.168.10.35:12310    |                     |
----------------------------------------------------------------------------------------------
|cachemgt               | 192.168.10.37:22300 | 192.168.10.35:22310    |                     |
----------------------------------------------------------------------------------------------
|navigate_go2           | dh.go2.cn           | 192.168.10.35:46110    |                     |
----------------------------------------------------------------------------------------------
|datamgt                | 192.168.10.37:26800 | 192.168.10.35:26810    |                     |
----------------------------------------------------------------------------------------------
|uploadserver           | tomcat_upload       | 192.168.10.35:33610    |                     |
----------------------------------------------------------------------------------------------
|helpmgt                | help.ximgs.net      | 192.168.10.35:13210    |                     |
----------------------------------------------------------------------------------------------
|wuliao                 | ycl.go2b2b.com      | 192.168.10.51:11010    |                     |
----------------------------------------------------------------------------------------------
|e3e3userCenter         | usercenter.3e3e.cn  | 192.168.10.51:61010   |                     |
----------------------------------------------------------------------------------------------
|propsmgt               | props.ximgs.net     | 192.168.10.40:37110   |                     |
----------------------------------------------------------------------------------------------
|imageserver            | webmonitornew.ximgs.net     | 118.31.112.251:27100   |                     |
----------------------------------------------------------------------------------------------

EOF

read -p "请输入一个项目名称:" PACKAGE
#read -p "请输入用户名:" USER

rm -f $WORK_DIRECTORY/*.war

cd $WORK_DIRECTORY


BASE_URL="http://192.168.10.203:8000/view/%E7%94%9F%E4%BA%A7%E7%8E%AF%E5%A2%83/job"

WAR_FILE="lastSuccessfulBuild/artifact/build/libs/workspace-2.0.war"


case $PACKAGE in
        navigate|navigate_go2|photography|product2tag|behavior|userTask|mmuserCenter|sitemapmgt|producer|datamgt|uploadserver|helpmgt|cachemgt)
        echo "wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}"
        wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}
        scp -P 40001 $WORK_DIRECTORY/workspace-2.0.war $USER@$REMOTE_HOST_1:~/${PACKAGE}".war"	
        ;;

        strength|observer|weixinmgt|mm2userCenter|monitorweb|sms|wuliao|e3e3userCenter)
        echo "wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}"
        wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}
        scp -P 40001 $WORK_DIRECTORY/workspace-2.0.war $USER@$REMOTE_HOST_3:~/${PACKAGE}".war"        
        ;;

        cache)
        echo "wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}"
        wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}
        scp -P 40001 $WORK_DIRECTORY/workspace-2.0.war $USER@$REMOTE_HOST_4:~/${PACKAGE}".war"        
        scp -P 40001 $WORK_DIRECTORY/workspace-2.0.war $USER@$REMOTE_HOST_5:~/${PACKAGE}".war"        
        ;;

        searchmgt)
        echo "wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}"
        wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}
        scp -P 40001 $WORK_DIRECTORY/workspace-2.0.war $USER@$REMOTE_HOST_3:~/${PACKAGE}".war"        
        ;;

        userCenter|admgt)
        echo "wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}"
        wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}
        scp -P 40001 $WORK_DIRECTORY/workspace-2.0.war $USER@$REMOTE_HOST_1:~/${PACKAGE}".war"
        scp -P 40001 $WORK_DIRECTORY/workspace-2.0.war $USER@$REMOTE_HOST_3:~/${PACKAGE}".war"
        ;;


        search)
        echo "wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}"
        wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}
        scp -P 40001 $WORK_DIRECTORY/workspace-2.0.war $USER@$REMOTE_HOST_3:~/${PACKAGE}".war"        
        scp -P 40001 $WORK_DIRECTORY/workspace-2.0.war $USER@$REMOTE_HOST_4:~/${PACKAGE}".war"        
        scp -P 40001 $WORK_DIRECTORY/workspace-2.0.war $USER@$REMOTE_HOST_5:~/${PACKAGE}".war"        
        ;;
        
        publish)
        echo "wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}"
        wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}
        scp -P 40001 $WORK_DIRECTORY/workspace-2.0.war $USER@$REMOTE_HOST_8:~/${PACKAGE}".war"        
        ;;



        sysmgt)
        echo "wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}"
        wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}
        scp -P 40001 $WORK_DIRECTORY/workspace-2.0.war $USER@$REMOTE_HOST_7:~/${PACKAGE}".war"        
	    ;;

        propsmgt)
        echo "wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}"
        wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}
        scp -P 40001 $WORK_DIRECTORY/workspace-2.0.war $USER@$REMOTE_HOST_5:~/${PACKAGE}".war"        
	    ;;

        imageserver)
        echo "wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}"
        wget ${BASE_URL}/${PACKAGE}"_production/"${WAR_FILE}
        scp -P 40001 $WORK_DIRECTORY/workspace-2.0.war $USER@$REMOTE_HOST_9:~/${PACKAGE}".war"        
	    ;;

        *)
        echo "please input right option"
        ;;
esac

